meeting/agenda/2024/03-26-editors.org
:PROPERTIES:
:ID:       55B82067-751B-40C9-8CF9-F9D06DC3C7C1
:END:
#+title: QT4 CG Editor’s Meeting Agenda 2024-03-26
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 15:00GMT (16:00CET, 11:00EDT, 08:00PDT).

*Attention: the zoom link for this meeting is different:*

+ https://us06web.zoom.us/j/83652799843?pwd=GU3AeLbCltTI6pbNPvbfbtYL0MhuRc.1

Reminder: The QT4CG meeting is scheduled on UK/European civil time. The United
States has switched to daylight saving time, so the meeting will be one hour
later there until the UK/Europe also switches (on 31 March 2024).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details, except for the zoom link which is
different this time:

+ https://us06web.zoom.us/j/83652799843?pwd=GU3AeLbCltTI6pbNPvbfbtYL0MhuRc.1

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Construct an agenda
:PROPERTIES:
:CUSTOM_ID: construct-agenda
:END:

Reviewing the minutes where this meeting was proposed, I think it’s possible
that some of the items have been overtaken by events. I don’t see an obvious set
of issues to discuss. I propose we begin by seeing who shows up and what the
attendees want to talk about.

Possible topics:

+ Editorial best practices
+ Test management
+ Open markup questions
  + HTML presentation of records
  + Non-breaking code elements

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
