meeting/agenda/2024/03-26-editors.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Editor’s Meeting Agenda 2024-03-26</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Editor’s Meeting Agenda 2024-03-26</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 15:00GMT (16:00CET, 11:00EDT, 08:00PDT).
</p>

<p>
<b>Attention: the zoom link for this meeting is different:</b>
</p>

<ul class="org-ul">
<li><a href="https://us06web.zoom.us/j/83652799843?pwd=GU3AeLbCltTI6pbNPvbfbtYL0MhuRc.1">https://us06web.zoom.us/j/83652799843?pwd=GU3AeLbCltTI6pbNPvbfbtYL0MhuRc.1</a></li>
</ul>

<p>
Reminder: The QT4CG meeting is scheduled on UK/European civil time. The United
States has switched to daylight saving time, so the meeting will be one hour
later there until the UK/Europe also switches (on 31 March 2024).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details, except for the zoom link which is
different this time:
</p>

<ul class="org-ul">
<li><a href="https://us06web.zoom.us/j/83652799843?pwd=GU3AeLbCltTI6pbNPvbfbtYL0MhuRc.1">https://us06web.zoom.us/j/83652799843?pwd=GU3AeLbCltTI6pbNPvbfbtYL0MhuRc.1</a></li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-construct-agenda" class="outline-3">
<h3 id="construct-agenda"><span class="section-number-3">1.2.</span> Construct an agenda</h3>
<div class="outline-text-3" id="text-construct-agenda">
<p>
Reviewing the minutes where this meeting was proposed, I think it’s possible
that some of the items have been overtaken by events. I don’t see an obvious set
of issues to discuss. I propose we begin by seeing who shows up and what the
attendees want to talk about.
</p>

<p>
Possible topics:
</p>

<ul class="org-ul">
<li>Editorial best practices</li>
<li>Test management</li>
<li>Open markup questions
<ul class="org-ul">
<li>HTML presentation of records</li>
<li>Non-breaking code elements</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">2.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
